src/InformationRegisters/DataAreas.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>DataAreas</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Presentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DataAreaStates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Repeat</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TimeZone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExportID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProcessingError</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>DataArea</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/DataAreaStates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>DataAreaStates</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>New</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Used</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToDelete</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Deleted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DeleteReady</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonForms/ImportDataIntoArea/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// FORM COMMAND HANDLERS

&AtClient
Procedure ContinueDataImport(Command)
	
	If SeparatorExists(SeparatorValue) Then
		Text = NStr("en = 'The specified data area exists. If import will be continued, current data can become damaged.
			|Do you want to continue data import?'");
		Result = DoQueryBox(Text, QuestionDialogMode.YesNo, , DialogReturnCode.No);
		
		If Result = DialogReturnCode.No Then
			Return;
		EndIf;
	EndIf;
	
	AddressInStorage = Undefined;
	If Not PutFile(AddressInStorage) Then
		Return;
	EndIf;
	
	Status(NStr("en = 'Importing data into the data area'"));
	Try
		ImportDataAtServer(AddressInStorage, SeparatorValue);
		
		Users.AuthenticateCurrentUser();
		
		InfoBaseUpdate.ExecuteInfoBaseUpdate(True);
		
		Cancel = False;
		
		StandardSubsystemsClient.ActionsBeforeStart(Cancel);
		
		If Cancel Then
			DoMessageBox(NStr("en = 'Data import completed with errors'"));
			Return;
		EndIf;
		
		StandardSubsystemsClient.ActionsOnStart();
		
		Status(NStr("en = 'Data import completed successfully'"));
	Except
		DoMessageBox(BriefErrorDescription(ErrorInfo()));
	EndTry;

EndProcedure

////////////////////////////////////////////////////////////////////////////////
// INTERNAL PROCEDURES AND FUNCTIONS

&AtServer
Procedure ImportDataAtServer(Val AddressInStorage, SeparatorValue)
	
	ArchiveData = GetFromTempStorage(AddressInStorage);
	ArchiveName = GetTempFileName("zip");
	ArchiveData.Write(ArchiveName);
	ArchiveData = Undefined;
	
	SetPrivilegedMode(True);
	
	CommonUse.SetSessionSeparation(True, SeparatorValue);
	
	If Not SeparatorExists(SeparatorValue) Then
		RecordManager = InformationRegisters.DataAreas.CreateRecordManager();
		RecordManager.DataArea = SeparatorValue;
		RecordManager.Presentation = SeparatorValue;
		RecordManager.State = Enums.DataAreaStates.Used;
		RecordManager.Write();
	EndIf;
	
	DataImportExport.ImportCurrentAreaFromArchive(ArchiveName);
	
	Try
		DeleteFiles(ArchiveName);
	Except
		WriteLogEvent(NStr("en = 'Deleting temporary files'"),
			EventLogLevel.Error,,,
			DetailErrorDescription(ErrorInfo()));
	EndTry;
	
EndProcedure

&AtServer
Function SeparatorExists(SeparatorValue)
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	DataAreas.DataArea
	|FROM
	|	InformationRegister.DataAreas AS DataAreas
	|WHERE
	|	DataAreas.DataArea = &DataArea";
	Query.SetParameter("DataArea", SeparatorValue);
	
	Return Not Query.Execute().IsEmpty();
	
EndFunction
